{"class_name": "Functional", "config": {"name": "DenseNet", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 35, 224], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims", "inbound_nodes": [["input_1", 0, 0, {"axis": 3}]]}, {"class_name": "Conv2D", "config": {"name": "Pre_Conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Pre_Conv", "inbound_nodes": [[["tf.expand_dims", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B1_CF1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B1_CF1_BatchNorm", "inbound_nodes": [[["Pre_Conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B1_CF1_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B1_CF1_ReLu", "inbound_nodes": [[["B1_CF1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B1_CF1_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B1_CF1_Conv2D", "inbound_nodes": [[["B1_CF1_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B1_CF1_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B1_CF1_Dropout", "inbound_nodes": [[["B1_CF1_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B1_CF2_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B1_CF2_BatchNorm", "inbound_nodes": [[["B1_CF1_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B1_CF2_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B1_CF2_ReLu", "inbound_nodes": [[["B1_CF2_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B1_CF2_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B1_CF2_Conv2D", "inbound_nodes": [[["B1_CF2_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B1_CF2_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B1_CF2_Dropout", "inbound_nodes": [[["B1_CF2_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B1_CF3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B1_CF3_BatchNorm", "inbound_nodes": [[["B1_CF2_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B1_CF3_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B1_CF3_ReLu", "inbound_nodes": [[["B1_CF3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B1_CF3_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B1_CF3_Conv2D", "inbound_nodes": [[["B1_CF3_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B1_CF3_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B1_CF3_Dropout", "inbound_nodes": [[["B1_CF3_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B1_CF4_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B1_CF4_BatchNorm", "inbound_nodes": [[["B1_CF3_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B1_CF4_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B1_CF4_ReLu", "inbound_nodes": [[["B1_CF4_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B1_CF4_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B1_CF4_Conv2D", "inbound_nodes": [[["B1_CF4_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B1_CF4_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B1_CF4_Dropout", "inbound_nodes": [[["B1_CF4_Conv2D", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "B1_Concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "B1_Concat", "inbound_nodes": [[["Pre_Conv", 0, 0, {}], ["B1_CF1_Dropout", 0, 0, {}], ["B1_CF2_Dropout", 0, 0, {}], ["B1_CF3_Dropout", 0, 0, {}], ["B1_CF4_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "T1_CF_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "T1_CF_BatchNorm", "inbound_nodes": [[["B1_Concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "T1_CF_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "T1_CF_ReLu", "inbound_nodes": [[["T1_CF_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "T1_CF_Conv2D", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "T1_CF_Conv2D", "inbound_nodes": [[["T1_CF_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "T1_CF_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "T1_CF_Dropout", "inbound_nodes": [[["T1_CF_Conv2D", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad", "inbound_nodes": [["T1_CF_Dropout", 0, 0, {"paddings": [[0, 0], [0, 1], [0, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "AveragePooling2D", "config": {"name": "T1_Pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}, "name": "T1_Pool", "inbound_nodes": [[["tf.compat.v1.pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B2_CF1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B2_CF1_BatchNorm", "inbound_nodes": [[["T1_Pool", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B2_CF1_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B2_CF1_ReLu", "inbound_nodes": [[["B2_CF1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B2_CF1_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B2_CF1_Conv2D", "inbound_nodes": [[["B2_CF1_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B2_CF1_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B2_CF1_Dropout", "inbound_nodes": [[["B2_CF1_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B2_CF2_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B2_CF2_BatchNorm", "inbound_nodes": [[["B2_CF1_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B2_CF2_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B2_CF2_ReLu", "inbound_nodes": [[["B2_CF2_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B2_CF2_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B2_CF2_Conv2D", "inbound_nodes": [[["B2_CF2_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B2_CF2_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B2_CF2_Dropout", "inbound_nodes": [[["B2_CF2_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B2_CF3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B2_CF3_BatchNorm", "inbound_nodes": [[["B2_CF2_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B2_CF3_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B2_CF3_ReLu", "inbound_nodes": [[["B2_CF3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B2_CF3_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B2_CF3_Conv2D", "inbound_nodes": [[["B2_CF3_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B2_CF3_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B2_CF3_Dropout", "inbound_nodes": [[["B2_CF3_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B2_CF4_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B2_CF4_BatchNorm", "inbound_nodes": [[["B2_CF3_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B2_CF4_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B2_CF4_ReLu", "inbound_nodes": [[["B2_CF4_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B2_CF4_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B2_CF4_Conv2D", "inbound_nodes": [[["B2_CF4_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B2_CF4_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B2_CF4_Dropout", "inbound_nodes": [[["B2_CF4_Conv2D", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "B2_Concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "B2_Concat", "inbound_nodes": [[["T1_Pool", 0, 0, {}], ["B2_CF1_Dropout", 0, 0, {}], ["B2_CF2_Dropout", 0, 0, {}], ["B2_CF3_Dropout", 0, 0, {}], ["B2_CF4_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "T2_CF_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "T2_CF_BatchNorm", "inbound_nodes": [[["B2_Concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "T2_CF_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "T2_CF_ReLu", "inbound_nodes": [[["T2_CF_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "T2_CF_Conv2D", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "T2_CF_Conv2D", "inbound_nodes": [[["T2_CF_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "T2_CF_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "T2_CF_Dropout", "inbound_nodes": [[["T2_CF_Conv2D", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "T2_Pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}, "name": "T2_Pool", "inbound_nodes": [[["T2_CF_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B3_CF1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B3_CF1_BatchNorm", "inbound_nodes": [[["T2_Pool", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B3_CF1_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B3_CF1_ReLu", "inbound_nodes": [[["B3_CF1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B3_CF1_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B3_CF1_Conv2D", "inbound_nodes": [[["B3_CF1_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B3_CF1_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B3_CF1_Dropout", "inbound_nodes": [[["B3_CF1_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B3_CF2_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B3_CF2_BatchNorm", "inbound_nodes": [[["B3_CF1_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B3_CF2_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B3_CF2_ReLu", "inbound_nodes": [[["B3_CF2_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B3_CF2_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B3_CF2_Conv2D", "inbound_nodes": [[["B3_CF2_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B3_CF2_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B3_CF2_Dropout", "inbound_nodes": [[["B3_CF2_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B3_CF3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B3_CF3_BatchNorm", "inbound_nodes": [[["B3_CF2_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B3_CF3_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B3_CF3_ReLu", "inbound_nodes": [[["B3_CF3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B3_CF3_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B3_CF3_Conv2D", "inbound_nodes": [[["B3_CF3_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B3_CF3_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B3_CF3_Dropout", "inbound_nodes": [[["B3_CF3_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B3_CF4_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B3_CF4_BatchNorm", "inbound_nodes": [[["B3_CF3_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B3_CF4_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B3_CF4_ReLu", "inbound_nodes": [[["B3_CF4_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B3_CF4_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B3_CF4_Conv2D", "inbound_nodes": [[["B3_CF4_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B3_CF4_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B3_CF4_Dropout", "inbound_nodes": [[["B3_CF4_Conv2D", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "B3_Concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "B3_Concat", "inbound_nodes": [[["T2_Pool", 0, 0, {}], ["B3_CF1_Dropout", 0, 0, {}], ["B3_CF2_Dropout", 0, 0, {}], ["B3_CF3_Dropout", 0, 0, {}], ["B3_CF4_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "T3_CF_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "T3_CF_BatchNorm", "inbound_nodes": [[["B3_Concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "T3_CF_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "T3_CF_ReLu", "inbound_nodes": [[["T3_CF_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "T3_CF_Conv2D", "trainable": true, "dtype": "float32", "filters": 112, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "T3_CF_Conv2D", "inbound_nodes": [[["T3_CF_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "T3_CF_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "T3_CF_Dropout", "inbound_nodes": [[["T3_CF_Conv2D", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_1", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "name": "tf.compat.v1.pad_1", "inbound_nodes": [["T3_CF_Dropout", 0, 0, {"paddings": [[0, 0], [0, 2], [0, 2], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"class_name": "AveragePooling2D", "config": {"name": "T3_Pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}, "name": "T3_Pool", "inbound_nodes": [[["tf.compat.v1.pad_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B4_CF1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B4_CF1_BatchNorm", "inbound_nodes": [[["T3_Pool", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B4_CF1_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B4_CF1_ReLu", "inbound_nodes": [[["B4_CF1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B4_CF1_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B4_CF1_Conv2D", "inbound_nodes": [[["B4_CF1_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B4_CF1_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B4_CF1_Dropout", "inbound_nodes": [[["B4_CF1_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B4_CF2_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B4_CF2_BatchNorm", "inbound_nodes": [[["B4_CF1_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B4_CF2_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B4_CF2_ReLu", "inbound_nodes": [[["B4_CF2_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B4_CF2_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B4_CF2_Conv2D", "inbound_nodes": [[["B4_CF2_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B4_CF2_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B4_CF2_Dropout", "inbound_nodes": [[["B4_CF2_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B4_CF3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B4_CF3_BatchNorm", "inbound_nodes": [[["B4_CF2_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B4_CF3_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B4_CF3_ReLu", "inbound_nodes": [[["B4_CF3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B4_CF3_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B4_CF3_Conv2D", "inbound_nodes": [[["B4_CF3_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B4_CF3_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B4_CF3_Dropout", "inbound_nodes": [[["B4_CF3_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B4_CF4_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B4_CF4_BatchNorm", "inbound_nodes": [[["B4_CF3_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B4_CF4_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B4_CF4_ReLu", "inbound_nodes": [[["B4_CF4_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B4_CF4_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B4_CF4_Conv2D", "inbound_nodes": [[["B4_CF4_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B4_CF4_Dropout", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "B4_CF4_Dropout", "inbound_nodes": [[["B4_CF4_Conv2D", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "B4_Concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "B4_Concat", "inbound_nodes": [[["T3_Pool", 0, 0, {}], ["B4_CF1_Dropout", 0, 0, {}], ["B4_CF2_Dropout", 0, 0, {}], ["B4_CF3_Dropout", 0, 0, {}], ["B4_CF4_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-08, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["B4_Concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ReLu", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d", "inbound_nodes": [[["ReLu", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "FC-D1", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "FC-D1", "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm-D1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-08, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm-D1", "inbound_nodes": [[["FC-D1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Logits", "trainable": true, "dtype": "float32", "units": 3, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Logits", "inbound_nodes": [[["BatchNorm-D1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["Logits", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}